OpenROV/openrov-arduino-cores/sam/boards.txt
# Copyright (c) 2015-2015 M2M4ALL BV.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

trident.name=Trident
trident.vid.0=0x2341
trident.pid.0=0x804d
trident.vid.1=0x2341
trident.pid.1=0x004d
trident.upload.tool=bossac
trident.upload.protocol=sam-ba
trident.upload.maximum_size=262144
trident.upload.use_1200bps_touch=true
trident.upload.wait_for_upload_port=true
trident.upload.native_usb=true
trident.build.mcu=cortex-m0plus
trident.build.f_cpu=48000000L
trident.build.usb_product="Trident"
trident.build.usb_manufacturer="OpenROV"
trident.build.board=OPENROV_TRIDENT
trident.build.core=arduino
trident.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
trident.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
trident.build.openocdscript=openocd_scripts/trident.cfg
trident.build.variant=trident
trident.build.variant_system_lib=
trident.build.vid=0x2341
trident.build.pid=0x804d
